[
  {
    "id": 1,
    "nome": "Cinetag",
    "image": "../../images/screenshot/cinetag-khaki.vercel.app_.png",
    "descricao": [
      "Este projeto é um reprodutor de vídeo, onde você pode escolher um vídeo que vem de uma API dentro de um servidor de teste, na página principal da aplicação para assistir, e com uma função para adicionar vídeos a uma lista de favoritos. Meu objetivo com o projeto era aprender a usar melhor o React Router para navegar entre diferentes páginas e obter uma compreensão mais clara do hook useEffect ao utilizá-lo com uma API para obter todos os vídeos para a página principal."
    ],
    "tecnologias": ["React", " Javascript", "Fetch API", "React Router", "HTML", "CSS"],
    "github": "https://github.com/BpCampos/cinetag",
    "website": "https://cinetag-khaki.vercel.app/"
  },
  {
    "id": 2,
    "nome": "Profile",
    "image": "../../images/screenshot/profile-gilt-nu.vercel.app_.png",
    "descricao": [
      "Este projeto recria um blog com informações sobre mim e diferentes postagens em páginas separadas para navegar. Ele foi desenvolvido com o objetivo principal de aprender a usar o React Router e entender como gerenciar os caminhos da aplicação."
    ],
    "tecnologias": ["React", "Javascript", "HTML", "CSS", "Vite", "React Router"],
    "github": "https://github.com/BpCampos/profile",
    "website": "https://profile-gilt-nu.vercel.app/"
  },
  {
    "id": 3,
    "nome": "Bitspace",
    "image": "../../images/screenshot/localhost_4000_.png",
    "descricao": [
      "Criei um e-commerce de produtos de informática como projeto final do curso Full Stack, utilizando EJS como view engine, CSS, Javascript, Node, Express, MySQL , Sequelize e o padrão MVC de arquitetura."
    ],
    "tecnologias": ["Javascript", "EJS", "CSS", "Node", "Express", "MySQL", "Sequelize"],
    "github": "https://github.com/BpCampos/Bitspace",
    "website": ""
  },
  {
    "id": 4,
    "nome": "NLW Spacetime",
    "image": "../../images/screenshot/nlwspacetime.png",
    "descricao": [
      "Projeto criado na semana Next Level da RocketSeat com objetivo de aprender mais afundo sobre tecnologias web, front end e back end. Consiste em uma máquina do tempo onde você pode armazenar uma memória, seja em vídeo ou imagem, utilizando o prisma como ORM e o SQLite para o banco de dados, linkar sua conta do github com o site através do OAuth e vizualizar as suas memórias cadastradas na página inicial através do React e do framework NextJs"
    ],
    "tecnologias": ["Typescript", "React", "Node", "Fastify", "HTML", "CSS", "NextJs", "tailwind", "Prisma", "SQLite"],
    "github": "https://github.com/BpCampos/NLW-Spacetime",
    "website": ""
  }
]
